"""
Problem solving series

Date: 14-01-2022
#4 - Electronic clock | Электрондық сағат
Сізге n саны берілген. Күн басынан бері n минут 
өтті. Сандық сағат осы сәтте қанша сағат 
пен минутты көрсететінін анықтаңыз. 
Бағдарлама екі санды шығаруы керек: сағат 
саны (0-ден 23-ке дейін) және минуттар саны 
(0-ден 59-ға дейін). n саны бір күндегі 
минуттар санынан көп болуы мүмкін екенін 
ескеріңіз.
* * * * * * * * * * * * * *
Test 1:
Входные данные (Input):     150
Выходные данные (Output):   2 30
* * * * * * * * * * * * * *
Test 2:
Входные данные (Input):     1441
Выходные данные (Output):   0 1
"""

n = int(input())

# 1 hour = 60 minutes
# 1 day = 24 hours
hour = (n // 6) % 24
minute = n % 60
print(hour, minute)
