"""
Problem solving series

Date: 15-01-2022
#5 - Maximum number | Үлкен сан
Екі бүтін a және b сандарын оқып, олардың 
ең үлкенін шығаратын программа жазыңыз. 
Сандар 1-ден 1000-ға дейінгі бүтін сандар.

Есепті шешу кезінде тек +, -, *, //, %, =, < 
және > бүтін арифметикалық амалдарды қолдануға 
болады. Сіз тармақтар, циклдар, модульді есептеу, 
квадрат түбірді шығару функциялары пайдалана 
алмайсыз.
* * * * * * * * * * * * * *
Test 1:
Входные данные (Input):     8
                            5
Выходные данные (Output):   8
* * * * * * * * * * * * * *
Test 2:
Входные данные (Input):     15
                            33
Выходные данные (Output):   33
"""

a = int(input())
b = int(input())

x = (a > b) * a + (a < b) * b
print(x)
