"""
Problem solving series

Date: 22-01-2022
#8 - Equals out of three | Тең сандар саны
*   *   *   *   *   *   *   *   *   *   *
Деректерді енгізу
Сізге бөлек жолдарға жазылған үш бүтін 
сан беріледі. Олардың қаншасы сәйкес 
келетінін анықтаңыз.

Шығару
Бағдарлама сандардың бірін шығаруы керек: 
3 (егер барлығы бірдей болса), 2 (егер 
екеуі бірдей болса) немесе 0 (егер барлық 
сандар әртүрлі болса). 
*   *   *   *   *   *   *   *   *   *   *
Test:
Входные данные (Input):     1
                            5
                            5
Выходные данные (Output):   2
"""

a = int(input())
b = int(input())
c = int(input())

if a == b == c:
    print(3)
elif a == b or b == c or c == a:
    print(2)
else:
    print(0)
