"""
Problem solving series

Date: 27-01-2022
#9 - Square numbers | Сандардың квадраты
Екі бүтін a және b сандарын оқып, олардың 
арасындағы сандардың квадратыны шығаратын п
рограмма жазыңыз. 
Сандар -1000-дан 1000-ға дейінгі бүтін сандар.

* * * * * * * * * * * * * *
Test 1:
Входные данные (Input):     0
                            5
Выходные данные (Output):   0
                            1
                            4
                            9
                            16
                            25
* * * * * * * * * * * * * *
Test 2:
Входные данные (Input):     -5
                            2
Выходные данные (Output):   25
                            16
                            9
                            4
                            1
                            0
                            1
                            4
"""

a = int(input())
b = int(input())

for i in range(a, b + 1, 1):
    print(i ** 2)
