"""  
Problem solving series

Date: 04-02-2022
13. Making cuts | Кесулер жасау - Python Есептер

Жол берілген.

- Алдымен осы жолдың үшінші таңбасын басып шығарыңыз.
- Екінші жолда осы жолдың соңғы белгісін басып шығарыңыз.
- Үшінші жолда осы жолдың алғашқы бес таңбасын басып шығарыңыз.
- Төртінші жолда соңғы екі таңбаны қоспағанда, бүкіл жолды 
басып шығарыңыз.
- Бесінші жолда барлық таңбаларды жұп индекстермен басып шығарыңыз 
(индекстеу 0-ден басталады, сондықтан таңбалар біріншіден басылып шығады).
- Алтыншы жолда тақ индекстері бар барлық таңбаларды басып 
шығарыңыз, яғни жолдың екінші таңбасынан бастап.
- Жетінші жолда барлық таңбаларды кері ретпен басып шығарыңыз.
- Сегізінші жолға берілген жолдың ұзындығын басып шығарыңыз.

* * * * * * * * * * * * * *
Test 1:
Енгізілген деректер (Input): 
Abrakadabra
Шығарылган деректер (Output): 
r
r
Abrak
Abrakadab
Arkdba
baaar
arbadakarbA
11
* * * * * * * * * * * * * *
"""

a = input()

# 1
print(a[2])

# 2
print(a[-1])

# 3
print(a[:5])

# 4
print(a[:-2])

# 5
print(a[1::2])

# 6
print(a[0::2])

# 7
print(a[::-1])

# 8
print(len(a))
