"""  
Problem solving series

Date: 14-02-2022
15. Even indexes | Жұп элементтер - Python Есептер

Бүтін сандар массиві беріледі.
Тізімнің барлық жұп индексті элементтерін  басып 
шығарыңыз (яғни A[0], A[2], A[4], ...).

* * * * * * * * * * * * * *
Test 1:
Енгізілген деректер (Input): 
6
1 
2 
3 
4 
5 
6  # [1,2,3,4,5,6]
Шығарылган деректер (Output): 
1 3 5
* * * * * * * * * * * * * *
Test 2:
Енгізілген деректер (Input): 
4
44
53
61
72  # [44,53,61,72]
Шығарылган деректер (Output): 
44 61
* * * * * * * * * * * * * *
"""

a = []
n = int(input())
for i in range(n):
    a.append(int(input()))
print(*a[::2])