"""  
Problem solving series

Date: 25-02-2022
21. Оңға бұру | Rotate Right - Python Есептер

Массив элементтерін оңға бұратын программа жазыңыз 
(мысалы, элементтер нөлден бастап нөмірленсе, 
онда 0-ші элемент 1-ші болады, 1-ші 2-ші болады, ..., 
соңғысы 0-ші болады, яғни [3, 5, 7, 9] массиві 
[9, 3, 5, 7] массивіне айналады)..
* * * * * * * * * * * * * *
Test 1:
Енгізілген деректер (Input): 
4
1 2 3 4
Шығарылган деректер (Output): 
4 1 2 3
* * * * * * * * * * * * * *
Test 2:
Енгізілген деректер (Input): 
6
2 7 6 3 5 4
Шығарылган деректер (Output): 
4 2 7 6 3 5
* * * * * * * * * * * * * *
"""
n = int(input())
a = list(map(int, input().split()))[:n]

result = [a[-1]] + a[:-1]
print(*result)
