"""  
Problem solving series

Date: 03-03-2022
22. Қатар | Line - Python Есептер

Аман алғаш рет жаңа мектепте дене шынықтыру 
сабағына келді. Сабақты бастамас бұрын оқушылар 
биіктікте, өспеу ретімен сапқа тұрады. Егер әр 
оқушының бойы алдын ала белгілі болса және бұл 
деректер өспейтін ретпен (яғни әрбір келесі) реттелген 
болса, дәстүрді бұзбау үшін Амандың қай қатарда тұруы 
керектігін анықтайтын бағдарлама жазыңыз. саны 
алдыңғысынан көп емес). Сыныпта бойы Аман сияқты бірнеше 
оқушы болса, онда бағдарлама оны олардың соңынан қоюы керек.

Алдымен N саны беріледі — студенттер саны (Аманды есептемегенде) 
(1≤N≤100). 
Содан кейін N саны бос орынмен — массив элементтерімен 
бөлініп жазылады. Жиым 200-ден аспайтын натурал сандардан тұрады 
(оқушылардың бойы сантиметрмен). 
Содан кейін жаңа жолға Амандың биіктігі енгізіледі.
* * * * * * * * * * * * * *
Test 1:
Енгізілген деректер (Input): 
8
165 163 160 160 157 157 155 154 
162
Шығарылган деректер (Output): 
3
* * * * * * * * * * * * * *
"""
n = int(input())
a = list(map(int, input().split()))[:n]
boiy = int(input())
oryn = 1

for i in range(n):
    if a[i] >= boiy:
        oryn += 1  # oryn = oryn + 1

print(oryn)
