"""  
Problem solving series

Date: 04-03-2022
23. Симметриялық матрица | Symmetrical matrix - Python Есептер

Екі өлшемді массивтің негізгі диагональ бойынша симметриялы екенін тексеріңіз. 
Негізгі диагональ - екі өлшемді массивтің жоғарғы сол бұрышынан төменгі 
оңға қарай өтетін диагональ. 

Бағдарлама кіріс ретінде n санын алады, ол массивтегі жолдар мен бағандар саны. 
Әрі қарай, кіріс ағыны массивтің элементтері болып табылатын әрқайсысы n саннан 
тұратын n жолды қамтиды.

Бағдарлама симметриялы массив үшін yes сөзін және асимметриялық массив үшін 
no сөзін шығаруы керек.
* * * * * * * * * * * * * *
Test 1:
Енгізілген деректер (Input): 
3
0 1 2
1 5 3
2 3 4
Шығарылган деректер (Output): 
yes
* * * * * * * * * * * * * *
Test 2:
Енгізілген деректер (Input): 
3
0 0 0
0 0 0
1 0 0
Шығарылган деректер (Output): 
no
* * * * * * * * * * * * * *
"""
n = int(input())
a = [list(map(int, input().split())) for i in range(n)]

result = 'yes'
for i in range(n):
    for j in range(n):
        if a[i][j] != a[j][i]:
            result = 'no'

print(result)
