"""  
Problem solving series

Date: 06-04-2022
24. Тура | Rook - Python Есептер

Көрсетілген координаталары (жол нөмірі және баған нөмірі) шаршыдағы 
тура басқа көрсетілген шаршыдағы бөлікті түсіретінін анықтау қажет.

Деректерді енгізу
Төрт сан енгізіледі: тураның координаталары (екі сан) және басқа 
шаршының координаталары (екі сан), әрбір сан жеке жолға енгізіледі. 
Координаттар 1-ден 8-ге дейінгі аралықтағы бүтін сандар.

Шығару
Егер тура 1 қозғалыста түсіре алса, ИӘ сөзін басып шығару керек, 
ал басқа жағдайда ЖОҚ.
* * * * * * * * * * * * * *
Test 1:
Енгізілген деректер (Input): 
1 1
2 2
Шығарылган деректер (Output): 
ЖОҚ
* * * * * * * * * * * * * *
Test 2:
Енгізілген деректер (Input): 
1 1
8 1
Шығарылган деректер (Output): 
ИӘ
* * * * * * * * * * * * * *
"""
a, b = map(int, input().split())
x, y = map(int, input().split())

if a == x or b == y:
    print("ИӘ")
else:
    print("ЖОҚ")
