"""  
Problem solving series

Date: 07-04-2022
25. Піл | Bishop - Python Есептер

Көрсетілген координаталары (жол нөмірі және баған нөмірі) шаршыдағы 
піл басқа көрсетілген шаршыдағы бөлікті түсіретінін анықтау қажет.

Деректерді енгізу
Төрт сан енгізіледі: пілдің координаталары (екі сан) және басқа 
шаршының координаталары (екі сан), әрбір сан жеке жолға енгізіледі. 
Координаттар 1-ден 8-ге дейінгі аралықтағы бүтін сандар.

Шығару
Егер піл 1 қозғалыста түсіре алса, ИӘ сөзін басып шығару керек, 
ал басқа жағдайда ЖОҚ.
* * * * * * * * * * * * * *
Test 1:
Енгізілген деректер (Input): 
1 1
2 3
Шығарылган деректер (Output): 
ЖОҚ
* * * * * * * * * * * * * *
Test 2:
Енгізілген деректер (Input): 
4 4
7 1
Шығарылган деректер (Output): 
ИӘ
* * * * * * * * * * * * * *
"""
a, b = map(int, input().split())
x, y = map(int, input().split())

if abs(x-a) == abs(y-b):
    print("ИӘ")
else:
    print("ЖОҚ")
