"""  
Problem solving series

Date: 09-04-2022
27. Уәзір | Queen - Python Есептер

Көрсетілген координаталары (жол нөмірі және баған нөмірі) шаршыдағы 
уәзір басқа көрсетілген шаршыдағы бөлікті түсіретінін анықтау қажет.

Деректерді енгізу
Төрт сан енгізіледі: аттың координаталары (екі сан) және басқа 
шаршының координаталары (екі сан), әрбір сан жеке жолға енгізіледі. 
Координаттар 1-ден 8-ге дейінгі аралықтағы бүтін сандар.

Шығару
Егер уәзір 1 қозғалыста түсіре алса, ИӘ сөзін басып шығару керек, 
ал басқа жағдайда ЖОҚ.
* * * * * * * * * * * * * *
Test 1:
Енгізілген деректер (Input): 
4 4
8 6
Шығарылган деректер (Output): 
ЖОҚ
* * * * * * * * * * * * * *
Test 2:
Енгізілген деректер (Input): 
4 3
2 5
Шығарылган деректер (Output): 
ИӘ
* * * * * * * * * * * * * *
"""
a, b = map(int, input().split())
x, y = map(int, input().split())

if a == x or b == y or abs(x-a) == abs(y-b):
    print("ИӘ")
else:
    print("ЖОҚ")
